<a href="https://colab.research.google.com/github/kingkong135/devc-challenge/blob/master/Week_1_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#SQL

##Task 1
Query all columns for a city in CITY with the ID 1661.

Input Format

The CITY table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

1.   List item
2.   List item

In [ ]:
SELECT * FROM CITY WHERE ID = 1661

##Task 2
Query all columns for all American cities in CITY with populations larger than 100000. The CountryCode for America is USA.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
SELECT * FROM CITY WHERE COUNTRYCODE = 'USA' AND POPULATION > 100000;

##Task 3
Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
SELECT * FROM CITY WHERE COUNTRYCODE = 'JPN';

##Task 4
Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
SELECT NAME FROM CITY WHERE COUNTRYCODE = 'JPN';

##Task 5
Query a list of CITY and STATE from the STATION table.

Input Format

The STATION table is described as follows:<br>
<img src = 'https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg'>

In [ ]:
SELECT CITY, STATE FROM STATION;

##Task 6
Query a list of CITY names from STATION with even ID numbers only. You may print the results in any order, but must exclude duplicates from your answer.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
SELECT DISTINCT CITY FROM STATION WHERE ID % 2 = 0;

Let  be the number of CITY entries in STATION, and let  be the number of distinct CITY names in STATION; query the value of  from STATION. In other words, find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

Input Format

The STATION table is described as follows:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg"><br>
where LAT_N is the northern latitude and LONG_W is the western longitude.

In [ ]:
SELECT COUNT(CITY) - COUNT(DISTINCT CITY) FROM STATION ;

##Task 7
Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

Input Format

The STATION table is described as follows:<br>
  <img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
SELECT CITY, LENGTH(CITY) FROM STATION ORDER BY LENGTH(CITY), CITY LIMIT 1;
SELECT CITY, LENGTH(CITY) FROM STATION ORDER BY LENGTH(CITY) DESC, CITY LIMIT 1;

##Task 8
Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg" >

In [ ]:
SELECT DISTINCT CITY
FROM STATION
WHERE  city REGEXP "^[aeiou].*";

##Task 9
Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:

SELECT DISTINCT CITY FROM STATION WHERE RIGHT(CITY,1) IN ('a','i','e','o','u');

##Task 10
Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
SELECT DISTINCT CITY FROM STATION WHERE CITY REGEXP '^[aeiou].*[aeiou]$';

## Optional 
### Queries with aggregates

SQL also supports the use of aggregate expressions (or functions) that allow you to summarize information about a group of rows of data.

Common aggregate functions:

| Functions | Description |
|:-:|:-:|
|**COUNT**(*), **COUNT**(column) | A common function used to counts the number of rows in the group if no column name is specified. Otherwise, count the number of rows in the group with non-NULL values in the specified column.|
|**MIN**(column) | Finds the smallest numerical value in the specified column for all rows in the group.|
|**MAX**(column) | Finds the largest numerical value in the specified column for all rows in the group.|
|**AVG**(column) | Finds the average numerical value in the specified column for all rows in the group.|
|**SUM**(column) | Finds the sum of all numerical values in the specified column for the rows in the group.|

More docs: [SQLite](http://www.sqlite.org/lang_aggfunc.html), [MySQL](https://dev.mysql.com/doc/refman/5.6/en/group-by-functions.html), [Postgres](http://www.postgresql.org/docs/9.4/static/functions-aggregate.html)

In addition to aggregating across all the rows, you can instead apply the aggregate functions to individual groups of data within that group. This would then create as many results as there are unique groups defined as by the  **GROUP BY** clause.

```
SELECT AGG_FUNC(column_or_expression) AS aggregate_description, …
FROM mytable
WHERE constraint_expression
GROUP BY column;
```

Our queries are getting fairly complex, but we have nearly introduced all the important parts of a  **SELECT** query. One thing that you might have noticed is that if the **GROUP BY** clause is executed after the **WHERE** clause (which filters the rows which are to be grouped), then how exactly do we filter the grouped rows?

Luckily, SQL allows us to do this by adding an additional **HAVING** clause which is used specifically with the **GROUP BY** clause to allow us to filter grouped rows from the result set.

```
SELECT group_by_column, AGG_FUNC(column_expression) AS aggregate_result_alias, …
FROM mytable
WHERE condition
GROUP BY column
HAVING group_condition;
```

In [ ]:
# Download database
!wget https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db

--2020-09-10 14:09:06--  https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db
Resolving ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com (ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com)... 52.219.41.15
Connecting to ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com (ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com)|52.219.41.15|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 884736 (864K) [binary/octet-stream]
Saving to: ‘chinook.db’

chinook.db          100%[===================>] 864.00K   772KB/s    in 1.1s

2020-09-10 14:09:08 (772 KB/s) - ‘chinook.db’ saved [884736/884736]

In [ ]:
import sqlite3
conn = sqlite3.connect('chinook.db')

In [ ]:
import pandas as pd
data = pd.read_sql_query('SELECT * FROM albums;', conn)
data.head() 
# head(n) is a function that show n first rows of the data, by default n=5

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [ ]:
# Find the revenue of 2013
pd.read_sql_query('''SELECT sum(total) as revenue_2013 FROM invoices where strftime("%Y", InvoiceDate) ="2013"''', conn)

   revenue_2013
0        450.58

In [ ]:
# Find the number of tracks belong to the genre Rock
pd.read_sql_query('''SELECT g.Name, sum(t.TrackId) as total
                    FROM tracks t
                    INNER JOIN  genres  g ON t.GenreId = g.GenreId
                    GROUP By g.Name
                    HAVING g.Name = "Rock"
                    ''', conn)

   Name    total
0  Rock  2307083

In [ ]:
# Find the number of customers each employee has supported
pd.read_sql_query('''SELECT e.FirstName, sum(c.SupportRepId) as Total
                    FROM customers as c
                    INNER JOIN employees as e ON c.SupportRepId = e.EmployeeId
                    GROUP BY e.FirstName
                    ''', conn)

  FirstName  Total
0      Jane     63
1  Margaret     80
2     Steve     90

In [ ]:
# Find the customer who paid the most
pd.read_sql_query('''
SELECT c.FirstName, c.LastName, sum(i.total) Income
FROM  customers c
INNER JOIN invoices i ON c.CustomerId = i.CustomerId
GROUP BY c.FirstName
ORDER BY Income DESC
LIMIT 1
''', conn)

  FirstName LastName  Income
0     Frank  Ralston   81.24

In [ ]:
# Find the richest artist
pd.read_sql_query(
'''
SELECT art.Name, sum(item.UnitPrice * item.Quantity) Income FROM artists as art
INNER JOIN albums al ON al.artistId = art.ArtistId
INNER JOIN tracks t ON al.AlbumId = t.AlbumId
INNER JOIN invoice_items item ON t.TrackId = item.TrackId 
GROUP BY art.Name
ORDER BY Income DESC
LIMIT 1
''', conn)

          Name  Income
0  Iron Maiden   138.6

In [ ]:
# Aggregate first()b
pd.read_sql_query('SELECT * FROM invoices ORDER By InvoiceDate LIMIT 1 ;',conn).head()

   InvoiceId  CustomerId  ... BillingPostalCode Total
0          1           2  ...             70174  1.98

[1 rows x 9 columns]

In [ ]:
# Aggregate first(), last()
pd.read_sql_query('SELECT * FROM invoices ORDER By InvoiceDate DESC LIMIT 1 ;',conn).head()

   InvoiceId  CustomerId  ... BillingPostalCode Total
0        412          58  ...            110017  1.99

[1 rows x 9 columns]

#Python

##Task 1
Task
Given an integer, perform the following conditional actions:

* If n is odd, print `Weird`
* If n is even and in the inclusive range of 2 to 5, print `Not Weird`
* If n is even and in the inclusive range of 6 to 20, print `Weird`
* If n is even and greater than 20, print `Not Weird`

Input Format

A single line containing a positive integer

Output Format

Print Weird if the number is weird; otherwise, print Not Weird.

In [ ]:
if __name__ == '__main__':
    # your code here
    n = int(input())
    if n % 2 ==1 :
        print("Weird")
    else:
        if n > 20 or n == 2 or n == 4:
            print("Not Weird")
        else:
            print("Weird")

12
Weird

##Task 2
Read two integers from STDIN and print three lines where:
<ol>
  <li>The first line contains the sum of the two numbers.</li>
  <li>The second line contains the difference of the two numbers (first - second).</li>
  <li>The third line contains the product of the two numbers.</li>
</ol>

**Input Format**

The first line contains the first integer, **a**. The second line contains the second integer, **b**.

**Output Format**

Print the three lines as explained above.

In [ ]:
if __name__ == '__main__':
    a = int(input())
    b = int(input())
    # your code here
    print(a + b)
    print(a - b)
    print(a * b)

1
2
3
-1
2

#Task 3
Task
Read an integer $N$. For all non-negative integers $i<N$ , print $i^{2}$. See the sample for details.

Input Format

The first and only line contains the integer, $N$ .

Constraints<br>
$1 \leq N \leq i$

Output Format

Print $N$ lines, one corresponding to each $i$.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    for i in range(1,n+1):
        print(i**2)

3
1
4
9

##Task 4
We add a Leap Day on February 29, almost every four years. The leap day is an extra, or intercalary day and we add it to the shortest month of the year, February.<br>

In the Gregorian calendar three criteria must be taken into account to identify leap years:
<ul>
<li>The year can be evenly divided by 4, is a leap year, unless:</li>
  <ul><li>The year can be evenly divided by 100, it is NOT a leap year, unless:</li>
    <ul><li>The year is also evenly divisible by 400. Then it is a leap year.</li></ul></ul></ul>
This means that in the Gregorian calendar, the years 2000 and 2400 are leap years, while 1800, 1900, 2100, 2200, 2300 and 2500 are NOT leap years.Source

**Task**<br>
<ul>
<li>You are given the year, and you have to write a function to check if the year is leap or not.</li>

  <li>Note that you have to complete the function and remaining code is given as template.</li>
  </ul>

**Input Format**

Read y, the year that needs to be checked.

**Constraints**<br>
$1900 \leq y \leq 10^{5}$

**Output Format**

Output is taken care of by the template. Your function must return a boolean value (True/False)

In [ ]:
def is_leap(year):
  # your code here
    if year % 4 == 0:
        if year % 100 == 0:
            if year % 400 == 0:
                return True
            else:
                return False
        else: 
            return True
    else:
        return False

In [ ]:
is_leap(300)

False

##Task 5
Given the participants' score sheet for your University Sports Day, you are required to find the runner-up score. You are given $n$ scores. Store them in a list and find the score of the runner-up.

**Input Format**

The first line contains $n$ . The second line contains an array $A[]$ of $n$ integers each separated by a space.

**Constraints**<br>
$2   \leq n \leq 10 $<br>
$-100 \leq A[i] \leq 100 $

Output Format

Print the runner-up score.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    # get unique values from a list
    a = set(map(int, input().strip().split()))
    a = list(a)
    a.sort(reverse=True)
    print(a[1])

5
5 3 3 4 1
4

## Advance Python
### 3 (Optional).
This problem was asked by Snapchat.

Given a list of possibly overlapping intervals, return a new list of intervals where all overlapping intervals have been merged.

The input list is not necessarily ordered in any way.

For example, given [(1, 3), (5, 8), (4, 10), (20, 25)], you should return [(1, 3), (4, 10), (20, 25)].

In [ ]:
def merge(arr): 		
		arr.sort(key = lambda x: x[0]) 
		m = [] 
		s = -10000
		max = -100000
		for i in range(len(arr)): 
			a = arr[i] 
			if a[0] > max: 
				if i != 0: 
					m.append([s,max]) 
				max = a[1] 
				s = a[0] 
			else: 
				if a[1] >= max: 
					max = a[1] 

		if max != -100000 and [s, max] not in m: 
			m.append([s, max]) 
		for i in range(len(m)): 
			print(m[i], end = " ") 

arr = [(1, 3), (5, 8), (4, 10), (20, 25)]
merge(arr)

[1, 3] [4, 10] [20, 25]